[
  {
    "id": "boringstocks",
    "title": "BoringStocks",
    "subtitle": "A minimalistic stock information website for the average trader.",
    "description": "BoringStocks was a collaboration project where I worked with a team of coders to create a lightweight stock information site that’s designed to be lightning fast. Specifically, I programmed the back-end, connecting the web application to our in house API. Furthermore my team and I wanted to finish the application on a short schedule so we opted to use an agile methodology to ensure our productivity was at its most efficient.",
    "images": [
      "boringstocks/boringstocks.png",
      "boringstocks/boringstocks-live.png"
    ],
    "links": [
      { "name": "Website", "link": "https://boringstocks.live" },
      {
        "name": "GitHub",
        "link": "https://github.com/BoringStocks/BoringStocks"
      },
      {
        "name": "Product Hunt",
        "link": "https://www.producthunt.com/posts/boringstocks?utm_source=badge-featured&utm_medium=badge&utm_souce=badge-boringstocks"
      }
    ]
  },
  {
    "id": "fentscraper",
    "title": "Fentanyl Epidemic Scraper",
    "subtitle": "A Go scraper that pulls fentanyl articles to follow the fentanyl epidemic trend",
    "description": "My mission for this project was to create a scraper that identifies articles relating to fentanyl as a means to map the trend of the fentanyl epidemic, specifically its distribution from illegal websites.",
    "images": [
      "fentscraper/fentscraper.png",
      "fentscraper/fentscraper-live.png"
    ],
    "links": [
      {
        "name": "Website",
        "link": "https://fentanyl-epidemic-tracker.xilaluna.com/"
      },
      {
        "name": "GitHub",
        "link": "https://fentanyl-epidemic-tracker.up.railway.app/"
      }
    ]
  },
  {
    "id": "coinstamp",
    "title": "CoinStamp",
    "subtitle": "Use decentralized currencies to buy and print your postage today.",
    "description": "CoinStamp is a single session based web application that allows users to buy USPS postage with crypto currencies. Sessions are used instead of direct collections because I wanted to create a quick one stop shop where users dont have to sign up or log in, in return this creates an user environment where privacy is at the utmost priority.",
    "images": ["coinstamp/coinstamp.png"],
    "links": [
      { "name": "GitHub", "link": "https://github.com/xiluna/CoinStamp" }
    ]
  },
  {
    "id": "pythonsteganography",
    "title": "Python Steganography",
    "subtitle": "Encode and decode images with python",
    "description": "This is a personal project of mine in which I created a python script to allow users to encode secret messages into their chosen image. In addition I also allow for the decoding of encoded images. I was able to do this by mainpulaing the least significant bit of the red channel for each pixel. ",
    "images": ["pythonstego/pythonstego.png"],
    "links": [
      {
        "name": "GitHub",
        "link": "https://github.com/xiluna/Python-Steganography"
      },
      {
        "name": "Docs",
        "link": "https://xiluna.github.io/Python-Steganography/"
      }
    ]
  },
  {
    "id": "breakoutoop",
    "title": "Breakout OOP",
    "subtitle": "A version of Breakout that's based on the MDN 2d tutorial, restructured into OOP.",
    "description": "For this project I took the challenge of diving into object oriented programming(OOP) by coding a well known game “Breakout” into this newly learned programming paradigm. I used the MDN 2d Breakout tutorial as a base for restructuring. Additionally I added eslint and bundled the program with webpack.",
    "images": ["breakout/breakout.png"],
    "links": [
      { "name": "GitHub", "link": "https://github.com/xiluna/Breakout" },
      { "name": "Docs", "link": "https://xiluna.github.io/Breakout/" }
    ]
  }
]
